{
  "config": {
    "step": {
      "user": {
        "title": "Balanceo de Carga para Cargadores de VE",
        "description": "Configura el sensor de consumo eléctrico y los parámetros del servicio eléctrico. Esta integración actualmente soporta un solo cargador. El soporte para múltiples cargadores está planificado para una versión futura.",
        "data": {
          "power_meter_entity": "Sensor de consumo eléctrico",
          "voltage": "Voltaje de suministro",
          "max_service_current": "Corriente máxima del servicio (capacidad del interruptor)",
          "unavailable_behavior": "Cuando el medidor no está disponible",
          "unavailable_fallback_current": "Corriente de respaldo (para modo 'Establecer una corriente específica')"
        },
        "data_description": {
          "power_meter_entity": "Entidad de sensor que reporta el consumo eléctrico total del hogar en Watts.",
          "voltage": "Voltaje nominal de suministro en Volts (usado para convertir W ↔ A).",
          "max_service_current": "Capacidad del interruptor principal en Amperes. La carga nunca excederá este límite.",
          "unavailable_behavior": "Qué hacer cuando el medidor de consumo no está disponible: detener la carga (más seguro), ignorar y mantener el último valor, o establecer una corriente específica (limitada al último objetivo seguro conocido).",
          "unavailable_fallback_current": "Corriente de carga (A) a usar cuando el medidor no está disponible y el modo es 'Establecer una corriente específica'. Este valor se limitará al último objetivo seguro conocido para evitar aumentos inseguros."
        }
      }
    },
    "error": {
      "entity_not_found": "No se encontró la entidad del sensor de consumo eléctrico seleccionado."
    },
    "abort": {
      "already_configured": "El Balanceo de Carga para Cargadores de VE ya está configurado."
    }
  },
  "entity": {
    "sensor": {
      "current_set": {
        "name": "Corriente de carga establecida"
      },
      "available_current": {
        "name": "Corriente disponible"
      }
    },
    "binary_sensor": {
      "active": {
        "name": "Balanceo de carga activo"
      }
    },
    "number": {
      "max_charger_current": {
        "name": "Corriente máxima del cargador"
      },
      "min_ev_current": {
        "name": "Corriente mínima del VE"
      }
    },
    "switch": {
      "enabled": {
        "name": "Balanceo de carga habilitado"
      }
    }
  }
}
